pok3r-custom/pok3r_re_firmware/doc/Holtek/HT32F1655_56_FWLib_v102_960/library/HT32F1655_56_Driver/src/ht32f1655_56_ckcu.c
/*********************************************************************************************************//**
 * @brief Configure the CK_REF prescaler.
 * @param CKREFPRE: CKCU_CKREFPRE_DIV2 ~ CKCU_CKREFPRE_DIV64 (CK_REF = CK_PLL / 2N)
 * @retval None
 ************************************************************************************************************/
void CKCU_SetCKREFPrescaler(CKCU_CKREFPRE_TypeDef CKREFPRE)
{
  CKCU_BF_WRITE(HT_CKCU->GCFGR, CKCU_MASK_CKREFPRE, CKCU_POS_CKREFPRE, CKREFPRE);
}

/*********************************************************************************************************//**
 * @brief Configure the CK_USART prescaler.
 * @param URPRE: specify the prescaler value.
 *        This parameter can be:
 *        @arg CKCU_URPRE_DIV1: USART clock divided by 1
 *        @arg CKCU_URPRE_DIV2: USART clock divided by 2
 * @retval None
 ************************************************************************************************************/
void CKCU_SetUSARTPrescaler(CKCU_URPRE_TypeDef URPRE)
{
  CKCU_BF_WRITE(HT_CKCU->GCFGR, CKCU_MASK_URPRE, CKCU_POS_URPRE, URPRE);
}

/*********************************************************************************************************//**
 * @brief Configure the CK_USB prescaler.
 * @param USBPRE: specify the value of divider.
 *        This parameter can be:
 *        @arg CKCU_USBPRE_DIV1: CK_USB = CK_PLL / 1
 *        @arg CKCU_USBPRE_DIV2: CK_USB = CK_PLL / 2
 *        @arg CKCU_USBPRE_DIV3: CK_USB = CK_PLL / 3
 * @retval None
 ************************************************************************************************************/
void CKCU_SetUSBPrescaler(CKCU_USBPRE_TypeDef USBPRE)
{
  CKCU_BF_WRITE(HT_CKCU->GCFGR, CKCU_MASK_USBPRE, CKCU_POS_USBPRE, USBPRE);
}

/*********************************************************************************************************//**
 * @brief Configure the CK_ADC prescaler.
 * @param ADCPRE: specify the prescaler value.
 *        This parameter can be:
 *        @arg CKCU_ADCPRE_DIV2 : CK_ADC = HCLK / 2
 *        @arg CKCU_ADCPRE_DIV4 : CK_ADC = HCLK / 4
 *        @arg CKCU_ADCPRE_DIV6 : CK_ADC = HCLK / 6
 *        @arg CKCU_ADCPRE_DIV8 : CK_ADC = HCLK / 8
 *        @arg CKCU_ADCPRE_DIV16: CK_ADC = HCLK / 16
 *        @arg CKCU_ADCPRE_DIV32: CK_ADC = HCLK / 32
 *        @arg CKCU_ADCPRE_DIV64: CK_ADC = HCLK / 64
 * @retval None
 ************************************************************************************************************/
void CKCU_SetADCPrescaler(CKCU_ADCPRE_TypeDef ADCPRE)
{
  CKCU_BF_WRITE(HT_CKCU->APBCFGR, CKCU_MASK_ADCDIV, CKCU_POS_ADCDIV, ADCPRE);
}

/*********************************************************************************************************//**
 * @brief Return the frequency of the different clocks.
 * @param CKCU_Clk: pointer to CKCU_ClocksTypeDef structure to get the clocks frequency.
 * @retval None
 ************************************************************************************************************/
void CKCU_GetClocksFrequency(CKCU_ClocksTypeDef* CKCU_Clk)
{
  u32 urpre, div;
  u32 SystemCoreClockSrc = (HT_CKCU->CKST >> 30) & 3UL;

  CKCU_Clk->PLL_Freq = CKCU_GetPLLFrequency();

  /* Get system frequency                                                                                   */
  switch (SystemCoreClockSrc)
  {
    case CKCU_SW_PLL:
      CKCU_Clk->SYSCK_Freq = CKCU_Clk->PLL_Freq;
      break;
    case CKCU_SW_HSE:
      CKCU_Clk->SYSCK_Freq = HSE_VALUE;
      break;
    case CKCU_SW_HSI:
      CKCU_Clk->SYSCK_Freq = HSI_VALUE;
      break;
    default:
      CKCU_Clk->SYSCK_Freq = 0;
      break;
  }

  /* Get HCLK frequency                                                                                     */
  CKCU_Clk->HCLK_Freq = (CKCU_Clk->SYSCK_Freq) >> (HT_CKCU->AHBCFGR);

  /* Get USART frequency                                                                                    */
  urpre = CKCU_BF_READ(HT_CKCU->GCFGR, CKCU_MASK_URPRE, CKCU_POS_URPRE);
  CKCU_Clk->USART_Freq = (CKCU_Clk->HCLK_Freq) >> urpre;

  /* Get ADC frequency                                                                                      */
  div = CKCU_BF_READ(HT_CKCU->APBCFGR, CKCU_MASK_ADCDIV, CKCU_POS_ADCDIV);
  if (div == 7)
  {
    CKCU_Clk->ADC_Freq = (CKCU_Clk->HCLK_Freq) / 6;
  }
  else
  {
    CKCU_Clk->ADC_Freq = (CKCU_Clk->HCLK_Freq) >> div;
  }
}

/*********************************************************************************************************//**
 * @brief Return the operating frequency of the USART.
 * @retval Frequency in Hz
 ************************************************************************************************************/
u32 CKCU_GetUSARTClockFreq(void)
{
  CKCU_ClocksTypeDef Clock;

  CKCU_GetClocksFrequency(&Clock);

  return Clock.USART_Freq;
}

/*********************************************************************************************************//**
 * @brief Return the frequency of the PLL.
 * @retval PLL Frequency
 ************************************************************************************************************/
u32 CKCU_GetPLLFrequency(void)
{
  u32 pllNO, pllNF, ClockSrc;

  /* Get PLL frequency                                                                                      */
  if (CKCU_BB_PLLEN == DISABLE)
  {
    return 0;
  }

  ClockSrc = (CKCU_BB_PLLSRC == CKCU_PLLSRC_HSE) ? HSE_VALUE : HSI_VALUE;

  if (CKCU_BB_PLLBYPASS == ENABLE)
  {
    return ClockSrc;
  }

  pllNF = CKCU_BF_READ(HT_CKCU->PLLCFGR, CKCU_MASK_PFBD, CKCU_POS_PFBD);
  if (pllNF == 0)
    pllNF = 64;

  pllNO = CKCU_BF_READ(HT_CKCU->PLLCFGR, CKCU_MASK_POTD, CKCU_POS_POTD);
  pllNO = (u8)0x1 << pllNO;

  return ((ClockSrc / pllNO) * pllNF);
}

#ifdef HT32_USE_VER100
/*********************************************************************************************************//**
 * @brief Enable or Disable the APB peripheral 0 clock.
 * @param CKCU_APBP: specify the APB peripheral 0.
 *        This parameter can be:
 *        @arg CKCU_APBEN0_I2C0,   CKCU_APBEN0_I2C1,  CKCU_APBEN0_SPI0,  CKCU_APBEN0_SPI1, CKCU_APBEN0_USART0,
 *             CKCU_APBEN0_USART1, CKCU_APBEN0_UART0, CKCU_APBEN0_UART1, CKCU_APBEN0_AFIO, CKCU_APBEN0_EXTI,
 *             CKCU_APBEN0_SCI,    CKCU_APBEN0_I2S
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_APBPerip0ClockConfig(u32 CKCU_APBP, ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CKCU_APBEN0(CKCU_APBP));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  if (Cmd != DISABLE)
  {
    HT_CKCU->APBCCR0 |= CKCU_APBP;
  }
  else
  {
    HT_CKCU->APBCCR0 &= ~CKCU_APBP;
  }
}

